In [1]:
import pandas as pd

In [3]:
url = "https://storage.googleapis.com/kagglesdsdata/datasets/1591/2835/mls-salaries-2017.csv?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20240812%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20240812T214109Z&X-Goog-Expires=259200&X-Goog-SignedHeaders=host&X-Goog-Signature=1efc7550d7ec95031ce4b82e8aa4861edd7a5ef448c673b876642a8b63f93f18a06618edf2b01c061d418527a1bdea18b4bf46cfd68914e1d81da33fd9b016a5220ad4d7dc025df3a35576326ca434ef06bc2076055819c8b70c973eb54f2bbcf072a8782735b988750b40a6e6163c731c5affa9e68843a0b0f2141ff8f8affbf29c3786781b650f0841bd52cfd8b217631da30f6aa163a9b7018c8e71841a5218bcbaa6f943df8678c80107b7d80963af3339474c16e9763d70818eab1bea50119b2df7698374ff7f47caeec68f11cba441877739ecf425ef9e5b8dda6b464f3c6e1bc063546bbc1ba0f76bef316a3e555633c12600d288145f42cea24fdf32"
df = pd.read_csv(url)

In [5]:
df.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 616 entries, 0 to 615
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                616 non-null    object
 2   first_name               612 non-null    object
 3   position                 616 non-null    object
 4   base_salary              616 non-null    float64
 5   guaranteed_compensation  616 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [8]:
df.describe().round()

       base_salary  guaranteed_compensation
count        616.0                    616.0
mean      296978.0                 326139.0
std       671579.0                 748001.0
min        53000.0                  53000.0
25%        65631.0                  69903.0
50%       125000.0                 135002.0
75%       255375.0                 280939.0
max      6660000.0                7167500.0